Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_vic.h
/**
 * @file pic18f_q84_vic.h
 * @brief PIC18F27/47/57Q84 Vectored Interrupt Controller (VIC) register
 *        definitions.
 *
 * The PIC18F-Q84 VIC supports two priority levels (high and low) with a
 * fixed three-instruction-cycle latency from interrupt request to first
 * ISR instruction.  When multi-vector mode is enabled (MVECEN = 1 in
 * CONFIG3) the hardware indexes into a programmable Interrupt Vector Table
 * (IVT) stored in program memory, allowing each source to branch directly
 * to its own handler without software polling.
 *
 * Registers covered in this header:
 *
 *   IVT Control:
 *     - IVTLOCK  : IVT Lock (prevents accidental IVT relocation)
 *     - IVTAD    : Computed interrupt vector address (3 bytes, read-only)
 *     - IVTBASE  : IVT base address in program memory (3 bytes)
 *
 *   Interrupt Priority:
 *     - IPR0-IPR15  : Per-source priority assignment (1=high, 0=low)
 *
 *   Interrupt Enable:
 *     - PIE0-PIE15  : Per-source interrupt enable (1=enabled)
 *
 *   Interrupt Flags:
 *     - PIR0-PIR15  : Per-source interrupt flag (1=pending)
 *
 * Each PIR/PIE/IPR register set shares the same bit layout: one bit per
 * interrupt source, eight sources per register.  The PIR flag is set by
 * hardware on the triggering event and cleared by software (or by DMA).
 * The PIE bit enables the corresponding source.  The IPR bit selects
 * high (1) or low (0) priority when IPEN = 1.
 *
 * Note: The global and per-priority interrupt enables (GIE, GIEL, IPEN)
 * are in INTCON0, defined in pic18f_q84_cpu.h.
 *
 * All addresses are absolute SFR addresses.  Multi-byte registers are
 * little-endian (low byte at the base address).
 *
 * Reference: Microchip DS40002213D - PIC18F27/47/57Q84 Data Sheet
 *
 * @note This file is included automatically by pic18f_q84.h.
 *       It relies on SFR8() and SFR16() macros defined there.
 */

#ifndef PIC18F_Q84_VIC_H
#define PIC18F_Q84_VIC_H

/* ****************************************************************************
 *  Section 1 - IVT Control Registers
 * ****************************************************************************/

/* ============================================================================
 *  IVTLOCK - Interrupt Vector Table Lock Register
 * ============================================================================
 *  Address: 0x0459   (8-bit, read/write)
 *
 *  When IVTLOCKED is set to 1, the IVTAD and IVTBASE registers become
 *  read-only and cannot be modified until the next device reset.  This
 *  prevents accidental relocation of the vector table at run-time.
 *
 *  Writing this register requires the Microchip unlock sequence (see
 *  datasheet section on protected registers):
 *    1. Write 0x55 to a designated register
 *    2. Write 0xAA to the same register
 *    3. Set/clear the IVTLOCKED bit
 *
 *    Bit 7:1 - Reserved (read as 0)
 *    Bit 0   - IVTLOCKED  IVT Lock
 *              1 = IVTAD and IVTBASE registers are locked (read-only)
 *              0 = IVTAD and IVTBASE registers are writable
 * ========================================================================= */

#define IVTLOCK_ADDR 0x0459u
#define IVTLOCK SFR8(IVTLOCK_ADDR)

/* -- Bit positions -------------------------------------------------------- */
#define IVTLOCK_IVTLOCKED_POS 0 /**< IVT Lock bit position            */

/* -- Bit masks ------------------------------------------------------------ */
#define IVTLOCK_IVTLOCKED (1u << IVTLOCK_IVTLOCKED_POS) /**< 0x01 - 1=IVT locked until reset */

/* ============================================================================
 *  IVTAD - Interrupt Vector Table Address (Computed Vector)
 * ============================================================================
 *  Addresses: IVTADL = 0x045A, IVTADH = 0x045B, IVTADU = 0x045C
 *  (3-byte, read-only)
 *
 *  When an interrupt is acknowledged, the hardware computes the vector
 *  address for the current interrupt source and places it here.  The
 *  computed address is:
 *
 *      IVTAD = IVTBASE + (2 * interrupt_vector_number)
 *
 *  Each vector table entry is two bytes (a GOTO instruction).  The
 *  IVTAD register is intended for diagnostic/debug use; the hardware
 *  uses it internally to fetch the ISR entry point.
 *
 *    IVTADL  Bit 7:0  - Computed vector address bits 7:0
 *    IVTADH  Bit 7:0  - Computed vector address bits 15:8
 *    IVTADU  Bit 4:0  - Computed vector address bits 20:16
 *            Bit 7:5  - Reserved (read as 0)
 * ========================================================================= */

#define IVTADL_ADDR 0x045Au
#define IVTADH_ADDR 0x045Bu
#define IVTADU_ADDR 0x045Cu
#define IVTAD_ADDR IVTADL_ADDR /**< 16-bit base address     */

#define IVTADL SFR8(IVTADL_ADDR)
#define IVTADH SFR8(IVTADH_ADDR)
#define IVTADU SFR8(IVTADU_ADDR)
#define IVTAD SFR16(IVTAD_ADDR) /**< 16-bit access (low 16 bits) */

#define IVTADU_MASK 0x1Fu /**< Valid bits [4:0] of IVTADU       */

/* ============================================================================
 *  IVTBASE - Interrupt Vector Table Base Address
 * ============================================================================
 *  Addresses: IVTBASEL = 0x045D, IVTBASEH = 0x045E, IVTBASEU = 0x045F
 *  (3-byte, read/write when IVTLOCKED = 0)
 *
 *  Defines the base address of the interrupt vector table in program
 *  memory.  The table must be aligned to a 256-byte boundary (IVTBASEL
 *  should be 0x00), though the hardware only requires 2-byte alignment.
 *
 *  On Power-on Reset, the default IVTBASE value is 0x000008, placing
 *  the IVT immediately after the reset and high/low priority interrupt
 *  vectors at 0x000000, 0x000008.
 *
 *    IVTBASEL  Bit 7:0  - Base address bits 7:0
 *    IVTBASEH  Bit 7:0  - Base address bits 15:8
 *    IVTBASEU  Bit 4:0  - Base address bits 20:16
 *              Bit 7:5  - Reserved (read as 0)
 * ========================================================================= */

#define IVTBASEL_ADDR 0x045Du
#define IVTBASEH_ADDR 0x045Eu
#define IVTBASEU_ADDR 0x045Fu
#define IVTBASE_ADDR IVTBASEL_ADDR /**< 16-bit base address     */

#define IVTBASEL SFR8(IVTBASEL_ADDR)
#define IVTBASEH SFR8(IVTBASEH_ADDR)
#define IVTBASEU SFR8(IVTBASEU_ADDR)
#define IVTBASE SFR16(IVTBASE_ADDR) /**< 16-bit access (low 16 bits) */

#define IVTBASEU_MASK 0x1Fu /**< Valid bits [4:0] of IVTBASEU     */

