Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_vic.h
/* ****************************************************************************
 *  Section 2 - Interrupt Priority Registers (IPR0-IPR15)
 * ****************************************************************************
 *
 *  Addresses: 0x0360-0x036F  (sixteen 8-bit registers)
 *
 *  Each bit selects the priority level for one interrupt source:
 *    1 = High-priority interrupt (serviced via GIEH / GIE)
 *    0 = Low-priority interrupt  (serviced via GIEL, requires IPEN = 1)
 *
 *  When IPEN = 0 (legacy mode), priority bits are ignored and all
 *  interrupts are high-priority.
 *
 *  The bit positions in each IPR register correspond directly to the
 *  same bit positions in the matching PIE and PIR registers (e.g.,
 *  IPR0 bit 7 controls the priority of the same source as PIE0 bit 7
 *  and PIR0 bit 7).
 * ***************************************************************************/

/* -- IPR Register Addresses ----------------------------------------------- */
#define IPR0_ADDR 0x0360u
#define IPR1_ADDR 0x0361u
#define IPR2_ADDR 0x0362u
#define IPR3_ADDR 0x0363u
#define IPR4_ADDR 0x0364u
#define IPR5_ADDR 0x0365u
#define IPR6_ADDR 0x0366u
#define IPR7_ADDR 0x0367u
#define IPR8_ADDR 0x0368u
#define IPR9_ADDR 0x0369u
#define IPR10_ADDR 0x036Au
#define IPR11_ADDR 0x036Bu
#define IPR12_ADDR 0x036Cu
#define IPR13_ADDR 0x036Du
#define IPR14_ADDR 0x036Eu
#define IPR15_ADDR 0x036Fu

/* -- IPR Register Access -------------------------------------------------- */
#define IPR0 SFR8(IPR0_ADDR)
#define IPR1 SFR8(IPR1_ADDR)
#define IPR2 SFR8(IPR2_ADDR)
#define IPR3 SFR8(IPR3_ADDR)
#define IPR4 SFR8(IPR4_ADDR)
#define IPR5 SFR8(IPR5_ADDR)
#define IPR6 SFR8(IPR6_ADDR)
#define IPR7 SFR8(IPR7_ADDR)
#define IPR8 SFR8(IPR8_ADDR)
#define IPR9 SFR8(IPR9_ADDR)
#define IPR10 SFR8(IPR10_ADDR)
#define IPR11 SFR8(IPR11_ADDR)
#define IPR12 SFR8(IPR12_ADDR)
#define IPR13 SFR8(IPR13_ADDR)
#define IPR14 SFR8(IPR14_ADDR)
#define IPR15 SFR8(IPR15_ADDR)

/* ============================================================================
 *  IPR0 - Interrupt Priority Register 0
 * ============================================================================
 *  Address: 0x0360
 *
 *    Bit 7 - IOCIP    : Interrupt-on-Change priority
 *    Bit 6 - OSFIP    : Oscillator Fail priority
 *    Bit 5 - HLVDIP   : High/Low-Voltage Detect priority
 *    Bit 4 - SWINTIP  : Software Interrupt priority
 *    Bit 3 - CANIP    : CAN module priority
 *    Bit 2 - ADIP     : ADC Conversion Complete priority
 *    Bit 1 - ZCDIP    : Zero-Cross Detection priority
 *    Bit 0 - INT0IP   : External Interrupt 0 priority
 * ========================================================================= */

#define IPR0_IOCIP_POS 7
#define IPR0_OSFIP_POS 6
#define IPR0_HLVDIP_POS 5
#define IPR0_SWINTIP_POS 4
#define IPR0_CANIP_POS 3
#define IPR0_ADIP_POS 2
#define IPR0_ZCDIP_POS 1
#define IPR0_INT0IP_POS 0

#define IPR0_IOCIP (1u << IPR0_IOCIP_POS)     /**< 0x80 */
#define IPR0_OSFIP (1u << IPR0_OSFIP_POS)     /**< 0x40 */
#define IPR0_HLVDIP (1u << IPR0_HLVDIP_POS)   /**< 0x20 */
#define IPR0_SWINTIP (1u << IPR0_SWINTIP_POS) /**< 0x10 */
#define IPR0_CANIP (1u << IPR0_CANIP_POS)     /**< 0x08 */
#define IPR0_ADIP (1u << IPR0_ADIP_POS)       /**< 0x04 */
#define IPR0_ZCDIP (1u << IPR0_ZCDIP_POS)     /**< 0x02 */
#define IPR0_INT0IP (1u << IPR0_INT0IP_POS)   /**< 0x01 */

/* ============================================================================
 *  IPR1 - Interrupt Priority Register 1
 * ============================================================================
 *  Address: 0x0361
 *
 *    Bit 7 - CLC1IP   : CLC1 priority
 *    Bit 6 - ADCH3IP  : ADC Channel 3 Threshold priority
 *    Bit 5 - ADCH2IP  : ADC Channel 2 Threshold priority
 *    Bit 4 - ADCH1IP  : ADC Channel 1 Threshold priority
 *    Bit 3 - TU16AIP  : Universal Timer 16A priority
 *    Bit 2 - SPI1IP   : SPI1 General priority
 *    Bit 1 - SPI1TXIP : SPI1 Transmit priority
 *    Bit 0 - SPI1RXIP : SPI1 Receive priority
 * ========================================================================= */

#define IPR1_CLC1IP_POS 7
#define IPR1_ADCH3IP_POS 6
#define IPR1_ADCH2IP_POS 5
#define IPR1_ADCH1IP_POS 4
#define IPR1_TU16AIP_POS 3
#define IPR1_SPI1IP_POS 2
#define IPR1_SPI1TXIP_POS 1
#define IPR1_SPI1RXIP_POS 0

#define IPR1_CLC1IP (1u << IPR1_CLC1IP_POS)     /**< 0x80 */
#define IPR1_ADCH3IP (1u << IPR1_ADCH3IP_POS)   /**< 0x40 */
#define IPR1_ADCH2IP (1u << IPR1_ADCH2IP_POS)   /**< 0x20 */
#define IPR1_ADCH1IP (1u << IPR1_ADCH1IP_POS)   /**< 0x10 */
#define IPR1_TU16AIP (1u << IPR1_TU16AIP_POS)   /**< 0x08 */
#define IPR1_SPI1IP (1u << IPR1_SPI1IP_POS)     /**< 0x04 */
#define IPR1_SPI1TXIP (1u << IPR1_SPI1TXIP_POS) /**< 0x02 */
#define IPR1_SPI1RXIP (1u << IPR1_SPI1RXIP_POS) /**< 0x01 */

/* ============================================================================
 *  IPR2 - Interrupt Priority Register 2
 * ============================================================================
 *  Address: 0x0362
 *
 *    Bit 7 - CSWIIP   : Clock Switch priority
 *    Bit 6 - SMT1PWAIP: SMT1 Period/Width Acquisition priority
 *    Bit 5 - SMT1PRAIP: SMT1 Pulse/Running Acq. priority
 *    Bit 4 - SMT1IP   : SMT1 Match priority
 *    Bit 3 - U1EIP    : UART1 Error priority
 *    Bit 2 - SPI2IP   : SPI2 General priority
 *    Bit 1 - SPI2TXIP : SPI2 Transmit priority
 *    Bit 0 - SPI2RXIP : SPI2 Receive priority
 * ========================================================================= */

#define IPR2_CSWIIP_POS 7
#define IPR2_SMT1PWAIP_POS 6
#define IPR2_SMT1PRAIP_POS 5
#define IPR2_SMT1IP_POS 4
#define IPR2_U1EIP_POS 3
#define IPR2_SPI2IP_POS 2
#define IPR2_SPI2TXIP_POS 1
#define IPR2_SPI2RXIP_POS 0

#define IPR2_CSWIIP (1u << IPR2_CSWIIP_POS)       /**< 0x80 */
#define IPR2_SMT1PWAIP (1u << IPR2_SMT1PWAIP_POS) /**< 0x40 */
#define IPR2_SMT1PRAIP (1u << IPR2_SMT1PRAIP_POS) /**< 0x20 */
#define IPR2_SMT1IP (1u << IPR2_SMT1IP_POS)       /**< 0x10 */
#define IPR2_U1EIP (1u << IPR2_U1EIP_POS)         /**< 0x08 */
#define IPR2_SPI2IP (1u << IPR2_SPI2IP_POS)       /**< 0x04 */
#define IPR2_SPI2TXIP (1u << IPR2_SPI2TXIP_POS)   /**< 0x02 */
#define IPR2_SPI2RXIP (1u << IPR2_SPI2RXIP_POS)   /**< 0x01 */

/* ============================================================================
 *  IPR3 - Interrupt Priority Register 3
 * ============================================================================
 *  Address: 0x0363
 *
 *    Bit 7 - DMA1AIP   : DMA1 Abort priority
 *    Bit 6 - DMA1ORIP  : DMA1 Overrun priority
 *    Bit 5 - DMA1DCNTIP: DMA1 Destination Count priority
 *    Bit 4 - DMA1SCNTIP: DMA1 Source Count priority
 *    Bit 3 - ADCH4IP   : ADC Channel 4 Threshold priority
 *    Bit 2 - CM1IP     : Comparator 1 priority
 *    Bit 1 - CWG1IP    : CWG1 priority
 *    Bit 0 - I2C1IP    : I2C1 General priority
 * ========================================================================= */

#define IPR3_DMA1AIP_POS 7
#define IPR3_DMA1ORIP_POS 6
#define IPR3_DMA1DCNTIP_POS 5
#define IPR3_DMA1SCNTIP_POS 4
#define IPR3_ADCH4IP_POS 3
#define IPR3_CM1IP_POS 2
#define IPR3_CWG1IP_POS 1
#define IPR3_I2C1IP_POS 0

