Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_vic.h
#define IPR3_DMA1AIP (1u << IPR3_DMA1AIP_POS)       /**< 0x80 */
#define IPR3_DMA1ORIP (1u << IPR3_DMA1ORIP_POS)     /**< 0x40 */
#define IPR3_DMA1DCNTIP (1u << IPR3_DMA1DCNTIP_POS) /**< 0x20 */
#define IPR3_DMA1SCNTIP (1u << IPR3_DMA1SCNTIP_POS) /**< 0x10 */
#define IPR3_ADCH4IP (1u << IPR3_ADCH4IP_POS)       /**< 0x08 */
#define IPR3_CM1IP (1u << IPR3_CM1IP_POS)           /**< 0x04 */
#define IPR3_CWG1IP (1u << IPR3_CWG1IP_POS)         /**< 0x02 */
#define IPR3_I2C1IP (1u << IPR3_I2C1IP_POS)         /**< 0x01 */

/* ============================================================================
 *  IPR4 - Interrupt Priority Register 4
 * ============================================================================
 *  Address: 0x0364
 *
 *    Bit 7 - TMR0IP   : Timer0 priority
 *    Bit 6 - CCP1IP   : CCP1 priority
 *    Bit 5 - TMR1GIP  : Timer1 Gate priority
 *    Bit 4 - TMR1IP   : Timer1 Overflow priority
 *    Bit 3 - TMR2IP   : Timer2 Match priority
 *    Bit 2 - U1IP     : UART1 General priority
 *    Bit 1 - U1TXIP   : UART1 Transmit priority
 *    Bit 0 - U1RXIP   : UART1 Receive priority
 * ========================================================================= */

#define IPR4_TMR0IP_POS 7
#define IPR4_CCP1IP_POS 6
#define IPR4_TMR1GIP_POS 5
#define IPR4_TMR1IP_POS 4
#define IPR4_TMR2IP_POS 3
#define IPR4_U1IP_POS 2
#define IPR4_U1TXIP_POS 1
#define IPR4_U1RXIP_POS 0

#define IPR4_TMR0IP (1u << IPR4_TMR0IP_POS)   /**< 0x80 */
#define IPR4_CCP1IP (1u << IPR4_CCP1IP_POS)   /**< 0x40 */
#define IPR4_TMR1GIP (1u << IPR4_TMR1GIP_POS) /**< 0x20 */
#define IPR4_TMR1IP (1u << IPR4_TMR1IP_POS)   /**< 0x10 */
#define IPR4_TMR2IP (1u << IPR4_TMR2IP_POS)   /**< 0x08 */
#define IPR4_U1IP (1u << IPR4_U1IP_POS)       /**< 0x04 */
#define IPR4_U1TXIP (1u << IPR4_U1TXIP_POS)   /**< 0x02 */
#define IPR4_U1RXIP (1u << IPR4_U1RXIP_POS)   /**< 0x01 */

/* ============================================================================
 *  IPR5 - Interrupt Priority Register 5
 * ============================================================================
 *  Address: 0x0365
 *
 *    Bit 7 - PWM1IP   : PWM1 Period Match priority
 *    Bit 6 - PWM1PIP  : PWM1 Parameter priority
 *    Bit 5 - CANTIP   : CAN Transmit priority
 *    Bit 4 - CANRIP   : CAN Receive priority
 *    Bit 3 - I2C1EIP  : I2C1 Error priority
 *    Bit 2 - I2C1TXIP : I2C1 Transmit priority
 *    Bit 1 - I2C1RXIP : I2C1 Receive priority
 *    Bit 0 - INT1IP   : External Interrupt 1 priority
 * ========================================================================= */

#define IPR5_PWM1IP_POS 7
#define IPR5_PWM1PIP_POS 6
#define IPR5_CANTIP_POS 5
#define IPR5_CANRIP_POS 4
#define IPR5_I2C1EIP_POS 3
#define IPR5_I2C1TXIP_POS 2
#define IPR5_I2C1RXIP_POS 1
#define IPR5_INT1IP_POS 0

#define IPR5_PWM1IP (1u << IPR5_PWM1IP_POS)     /**< 0x80 */
#define IPR5_PWM1PIP (1u << IPR5_PWM1PIP_POS)   /**< 0x40 */
#define IPR5_CANTIP (1u << IPR5_CANTIP_POS)     /**< 0x20 */
#define IPR5_CANRIP (1u << IPR5_CANRIP_POS)     /**< 0x10 */
#define IPR5_I2C1EIP (1u << IPR5_I2C1EIP_POS)   /**< 0x08 */
#define IPR5_I2C1TXIP (1u << IPR5_I2C1TXIP_POS) /**< 0x04 */
#define IPR5_I2C1RXIP (1u << IPR5_I2C1RXIP_POS) /**< 0x02 */
#define IPR5_INT1IP (1u << IPR5_INT1IP_POS)     /**< 0x01 */

/* ============================================================================
 *  IPR6 - Interrupt Priority Register 6
 * ============================================================================
 *  Address: 0x0366
 *
 *    Bit 7 - PWM2IP   : PWM2 Period Match priority
 *    Bit 6 - PWM2PIP  : PWM2 Parameter priority
 *    Bit 5 - TMR3GIP  : Timer3 Gate priority
 *    Bit 4 - TMR3IP   : Timer3 Overflow priority
 *    Bit 3 - TU16BIP  : Universal Timer 16B priority
 *    Bit 2 - U2IP     : UART2 General priority
 *    Bit 1 - U2TXIP   : UART2 Transmit priority
 *    Bit 0 - U2RXIP   : UART2 Receive priority
 * ========================================================================= */

#define IPR6_PWM2IP_POS 7
#define IPR6_PWM2PIP_POS 6
#define IPR6_TMR3GIP_POS 5
#define IPR6_TMR3IP_POS 4
#define IPR6_TU16BIP_POS 3
#define IPR6_U2IP_POS 2
#define IPR6_U2TXIP_POS 1
#define IPR6_U2RXIP_POS 0

#define IPR6_PWM2IP (1u << IPR6_PWM2IP_POS)   /**< 0x80 */
#define IPR6_PWM2PIP (1u << IPR6_PWM2PIP_POS) /**< 0x40 */
#define IPR6_TMR3GIP (1u << IPR6_TMR3GIP_POS) /**< 0x20 */
#define IPR6_TMR3IP (1u << IPR6_TMR3IP_POS)   /**< 0x10 */
#define IPR6_TU16BIP (1u << IPR6_TU16BIP_POS) /**< 0x08 */
#define IPR6_U2IP (1u << IPR6_U2IP_POS)       /**< 0x04 */
#define IPR6_U2TXIP (1u << IPR6_U2TXIP_POS)   /**< 0x02 */
#define IPR6_U2RXIP (1u << IPR6_U2RXIP_POS)   /**< 0x01 */

/* ============================================================================
 *  IPR7 - Interrupt Priority Register 7
 * ============================================================================
 *  Address: 0x0367
 *
 *    Bit 7 - DMA2AIP   : DMA2 Abort priority
 *    Bit 6 - DMA2ORIP  : DMA2 Overrun priority
 *    Bit 5 - DMA2DCNTIP: DMA2 Destination Count priority
 *    Bit 4 - DMA2SCNTIP: DMA2 Source Count priority
 *    Bit 3 - NCO1IP    : NCO1 priority
 *    Bit 2 - U2EIP     : UART2 Error priority
 *    Bit 1 - CLC2IP    : CLC2 priority
 *    Bit 0 - INT2IP    : External Interrupt 2 priority
 * ========================================================================= */

#define IPR7_DMA2AIP_POS 7
#define IPR7_DMA2ORIP_POS 6
#define IPR7_DMA2DCNTIP_POS 5
#define IPR7_DMA2SCNTIP_POS 4
#define IPR7_NCO1IP_POS 3
#define IPR7_U2EIP_POS 2
#define IPR7_CLC2IP_POS 1
#define IPR7_INT2IP_POS 0

#define IPR7_DMA2AIP (1u << IPR7_DMA2AIP_POS)       /**< 0x80 */
#define IPR7_DMA2ORIP (1u << IPR7_DMA2ORIP_POS)     /**< 0x40 */
#define IPR7_DMA2DCNTIP (1u << IPR7_DMA2DCNTIP_POS) /**< 0x20 */
#define IPR7_DMA2SCNTIP (1u << IPR7_DMA2SCNTIP_POS) /**< 0x10 */
#define IPR7_NCO1IP (1u << IPR7_NCO1IP_POS)         /**< 0x08 */
#define IPR7_U2EIP (1u << IPR7_U2EIP_POS)           /**< 0x04 */
#define IPR7_CLC2IP (1u << IPR7_CLC2IP_POS)         /**< 0x02 */
#define IPR7_INT2IP (1u << IPR7_INT2IP_POS)         /**< 0x01 */

/* ============================================================================
 *  IPR8 - Interrupt Priority Register 8
 * ============================================================================
 *  Address: 0x0368
 *
 *    Bit 7 - CLC3IP   : CLC3 priority
 *    Bit 6 - CCP2IP   : CCP2 priority
 *    Bit 5 - TMR5GIP  : Timer5 Gate priority
 *    Bit 4 - TMR5IP   : Timer5 Overflow priority
 *    Bit 3 - TMR4IP   : Timer4 Match priority
 *    Bit 2 - CWG2IP   : CWG2 priority
 *    Bit 1 - CM2IP    : Comparator 2 priority
 *    Bit 0 - NCO2IP   : NCO2 priority
 * ========================================================================= */

#define IPR8_CLC3IP_POS 7
#define IPR8_CCP2IP_POS 6
#define IPR8_TMR5GIP_POS 5
#define IPR8_TMR5IP_POS 4
#define IPR8_TMR4IP_POS 3
#define IPR8_CWG2IP_POS 2
#define IPR8_CM2IP_POS 1
#define IPR8_NCO2IP_POS 0

#define IPR8_CLC3IP (1u << IPR8_CLC3IP_POS)   /**< 0x80 */
#define IPR8_CCP2IP (1u << IPR8_CCP2IP_POS)   /**< 0x40 */
#define IPR8_TMR5GIP (1u << IPR8_TMR5GIP_POS) /**< 0x20 */
#define IPR8_TMR5IP (1u << IPR8_TMR5IP_POS)   /**< 0x10 */
#define IPR8_TMR4IP (1u << IPR8_TMR4IP_POS)   /**< 0x08 */
#define IPR8_CWG2IP (1u << IPR8_CWG2IP_POS)   /**< 0x04 */
#define IPR8_CM2IP (1u << IPR8_CM2IP_POS)     /**< 0x02 */
#define IPR8_NCO2IP (1u << IPR8_NCO2IP_POS)   /**< 0x01 */

/* ============================================================================
 *  IPR9 - Interrupt Priority Register 9
 * ============================================================================
 *  Address: 0x0369
 *
 *    Bit 7 - DMA3AIP   : DMA3 Abort priority
 *    Bit 6 - DMA3ORIP  : DMA3 Overrun priority
 *    Bit 5 - DMA3DCNTIP: DMA3 Destination Count priority
 *    Bit 4 - DMA3SCNTIP: DMA3 Source Count priority
 *    Bit 3 - PWM3IP    : PWM3 Period Match priority
 *    Bit 2 - PWM3PIP   : PWM3 Parameter priority
 *    Bit 1 - CWG3IP    : CWG3 priority
 *    Bit 0 - NCO3IP    : NCO3 priority
 * ========================================================================= */

#define IPR9_DMA3AIP_POS 7
#define IPR9_DMA3ORIP_POS 6
#define IPR9_DMA3DCNTIP_POS 5
#define IPR9_DMA3SCNTIP_POS 4
#define IPR9_PWM3IP_POS 3
#define IPR9_PWM3PIP_POS 2
#define IPR9_CWG3IP_POS 1
#define IPR9_NCO3IP_POS 0

#define IPR9_DMA3AIP (1u << IPR9_DMA3AIP_POS)       /**< 0x80 */
#define IPR9_DMA3ORIP (1u << IPR9_DMA3ORIP_POS)     /**< 0x40 */
#define IPR9_DMA3DCNTIP (1u << IPR9_DMA3DCNTIP_POS) /**< 0x20 */
#define IPR9_DMA3SCNTIP (1u << IPR9_DMA3SCNTIP_POS) /**< 0x10 */
#define IPR9_PWM3IP (1u << IPR9_PWM3IP_POS)         /**< 0x08 */
#define IPR9_PWM3PIP (1u << IPR9_PWM3PIP_POS)       /**< 0x04 */
#define IPR9_CWG3IP (1u << IPR9_CWG3IP_POS)         /**< 0x02 */
#define IPR9_NCO3IP (1u << IPR9_NCO3IP_POS)         /**< 0x01 */

/* ============================================================================
 *  IPR10 - Interrupt Priority Register 10
 * ============================================================================
 *  Address: 0x036A
 *
 *    Bit 7 - CLC4IP    : CLC4 priority
 *    Bit 6 - CCP3IP    : CCP3 priority
 *    Bit 5 - U3EIP     : UART3 Error priority
 *    Bit 4 - U3IP      : UART3 General priority
 *    Bit 3 - U3TXIP    : UART3 Transmit priority
 *    Bit 2 - U3RXIP    : UART3 Receive priority
 *    Bit 1 - TMR6IP    : Timer6 Match priority
 *    Bit 0 - DSMIP     : DSM priority
 * ========================================================================= */

#define IPR10_CLC4IP_POS 7
#define IPR10_CCP3IP_POS 6
#define IPR10_U3EIP_POS 5
#define IPR10_U3IP_POS 4
#define IPR10_U3TXIP_POS 3
#define IPR10_U3RXIP_POS 2
#define IPR10_TMR6IP_POS 1
#define IPR10_DSMIP_POS 0

