Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_vic.h
#define IPR10_CLC4IP (1u << IPR10_CLC4IP_POS) /**< 0x80 */
#define IPR10_CCP3IP (1u << IPR10_CCP3IP_POS) /**< 0x40 */
#define IPR10_U3EIP (1u << IPR10_U3EIP_POS)   /**< 0x20 */
#define IPR10_U3IP (1u << IPR10_U3IP_POS)     /**< 0x10 */
#define IPR10_U3TXIP (1u << IPR10_U3TXIP_POS) /**< 0x08 */
#define IPR10_U3RXIP (1u << IPR10_U3RXIP_POS) /**< 0x04 */
#define IPR10_TMR6IP (1u << IPR10_TMR6IP_POS) /**< 0x02 */
#define IPR10_DSMIP (1u << IPR10_DSMIP_POS)   /**< 0x01 */

/* ============================================================================
 *  IPR11 - Interrupt Priority Register 11
 * ============================================================================
 *  Address: 0x036B
 *
 *    Bit 7 - DMA4AIP   : DMA4 Abort priority
 *    Bit 6 - DMA4ORIP  : DMA4 Overrun priority
 *    Bit 5 - DMA4DCNTIP: DMA4 Destination Count priority
 *    Bit 4 - DMA4SCNTIP: DMA4 Source Count priority
 *    Bit 3 - CLC5IP    : CLC5 priority
 *    Bit 2 - CLC6IP    : CLC6 priority
 *    Bit 1 - U4EIP     : UART4 Error priority
 *    Bit 0 - U4IP      : UART4 General priority
 * ========================================================================= */

#define IPR11_DMA4AIP_POS 7
#define IPR11_DMA4ORIP_POS 6
#define IPR11_DMA4DCNTIP_POS 5
#define IPR11_DMA4SCNTIP_POS 4
#define IPR11_CLC5IP_POS 3
#define IPR11_CLC6IP_POS 2
#define IPR11_U4EIP_POS 1
#define IPR11_U4IP_POS 0

#define IPR11_DMA4AIP (1u << IPR11_DMA4AIP_POS)       /**< 0x80 */
#define IPR11_DMA4ORIP (1u << IPR11_DMA4ORIP_POS)     /**< 0x40 */
#define IPR11_DMA4DCNTIP (1u << IPR11_DMA4DCNTIP_POS) /**< 0x20 */
#define IPR11_DMA4SCNTIP (1u << IPR11_DMA4SCNTIP_POS) /**< 0x10 */
#define IPR11_CLC5IP (1u << IPR11_CLC5IP_POS)         /**< 0x08 */
#define IPR11_CLC6IP (1u << IPR11_CLC6IP_POS)         /**< 0x04 */
#define IPR11_U4EIP (1u << IPR11_U4EIP_POS)           /**< 0x02 */
#define IPR11_U4IP (1u << IPR11_U4IP_POS)             /**< 0x01 */

/* ============================================================================
 *  IPR12 - Interrupt Priority Register 12
 * ============================================================================
 *  Address: 0x036C
 *
 *    Bit 7 - U4TXIP    : UART4 Transmit priority
 *    Bit 6 - U4RXIP    : UART4 Receive priority
 *    Bit 5 - DMA5AIP   : DMA5 Abort priority
 *    Bit 4 - DMA5ORIP  : DMA5 Overrun priority
 *    Bit 3 - DMA5DCNTIP: DMA5 Destination Count priority
 *    Bit 2 - DMA5SCNTIP: DMA5 Source Count priority
 *    Bit 1 - CLC7IP    : CLC7 priority
 *    Bit 0 - CLC8IP    : CLC8 priority
 * ========================================================================= */

#define IPR12_U4TXIP_POS 7
#define IPR12_U4RXIP_POS 6
#define IPR12_DMA5AIP_POS 5
#define IPR12_DMA5ORIP_POS 4
#define IPR12_DMA5DCNTIP_POS 3
#define IPR12_DMA5SCNTIP_POS 2
#define IPR12_CLC7IP_POS 1
#define IPR12_CLC8IP_POS 0

#define IPR12_U4TXIP (1u << IPR12_U4TXIP_POS)         /**< 0x80 */
#define IPR12_U4RXIP (1u << IPR12_U4RXIP_POS)         /**< 0x40 */
#define IPR12_DMA5AIP (1u << IPR12_DMA5AIP_POS)       /**< 0x20 */
#define IPR12_DMA5ORIP (1u << IPR12_DMA5ORIP_POS)     /**< 0x10 */
#define IPR12_DMA5DCNTIP (1u << IPR12_DMA5DCNTIP_POS) /**< 0x08 */
#define IPR12_DMA5SCNTIP (1u << IPR12_DMA5SCNTIP_POS) /**< 0x04 */
#define IPR12_CLC7IP (1u << IPR12_CLC7IP_POS)         /**< 0x02 */
#define IPR12_CLC8IP (1u << IPR12_CLC8IP_POS)         /**< 0x01 */

/* ============================================================================
 *  IPR13 - Interrupt Priority Register 13
 * ============================================================================
 *  Address: 0x036D
 *
 *    Bit 7 - DMA6AIP   : DMA6 Abort priority
 *    Bit 6 - DMA6ORIP  : DMA6 Overrun priority
 *    Bit 5 - DMA6DCNTIP: DMA6 Destination Count priority
 *    Bit 4 - DMA6SCNTIP: DMA6 Source Count priority
 *    Bit 3 - U5EIP     : UART5 Error priority
 *    Bit 2 - U5IP      : UART5 General priority
 *    Bit 1 - U5TXIP    : UART5 Transmit priority
 *    Bit 0 - U5RXIP    : UART5 Receive priority
 * ========================================================================= */

#define IPR13_DMA6AIP_POS 7
#define IPR13_DMA6ORIP_POS 6
#define IPR13_DMA6DCNTIP_POS 5
#define IPR13_DMA6SCNTIP_POS 4
#define IPR13_U5EIP_POS 3
#define IPR13_U5IP_POS 2
#define IPR13_U5TXIP_POS 1
#define IPR13_U5RXIP_POS 0

#define IPR13_DMA6AIP (1u << IPR13_DMA6AIP_POS)       /**< 0x80 */
#define IPR13_DMA6ORIP (1u << IPR13_DMA6ORIP_POS)     /**< 0x40 */
#define IPR13_DMA6DCNTIP (1u << IPR13_DMA6DCNTIP_POS) /**< 0x20 */
#define IPR13_DMA6SCNTIP (1u << IPR13_DMA6SCNTIP_POS) /**< 0x10 */
#define IPR13_U5EIP (1u << IPR13_U5EIP_POS)           /**< 0x08 */
#define IPR13_U5IP (1u << IPR13_U5IP_POS)             /**< 0x04 */
#define IPR13_U5TXIP (1u << IPR13_U5TXIP_POS)         /**< 0x02 */
#define IPR13_U5RXIP (1u << IPR13_U5RXIP_POS)         /**< 0x01 */

/* ============================================================================
 *  IPR14 - Interrupt Priority Register 14
 * ============================================================================
 *  Address: 0x036E
 *
 *    Bit 7 - DMA7AIP   : DMA7 Abort priority
 *    Bit 6 - DMA7ORIP  : DMA7 Overrun priority
 *    Bit 5 - DMA7DCNTIP: DMA7 Destination Count priority
 *    Bit 4 - DMA7SCNTIP: DMA7 Source Count priority
 *    Bit 3 - CRCIP     : CRC priority
 *    Bit 2 - SCANIP    : NVM Scanner priority
 *    Bit 1 - ACTIP     : Active Clock Tuning priority
 *    Bit 0 - NVMIP     : NVM Write Complete priority
 * ========================================================================= */

#define IPR14_DMA7AIP_POS 7
#define IPR14_DMA7ORIP_POS 6
#define IPR14_DMA7DCNTIP_POS 5
#define IPR14_DMA7SCNTIP_POS 4
#define IPR14_CRCIP_POS 3
#define IPR14_SCANIP_POS 2
#define IPR14_ACTIP_POS 1
#define IPR14_NVMIP_POS 0

#define IPR14_DMA7AIP (1u << IPR14_DMA7AIP_POS)       /**< 0x80 */
#define IPR14_DMA7ORIP (1u << IPR14_DMA7ORIP_POS)     /**< 0x40 */
#define IPR14_DMA7DCNTIP (1u << IPR14_DMA7DCNTIP_POS) /**< 0x20 */
#define IPR14_DMA7SCNTIP (1u << IPR14_DMA7SCNTIP_POS) /**< 0x10 */
#define IPR14_CRCIP (1u << IPR14_CRCIP_POS)           /**< 0x08 */
#define IPR14_SCANIP (1u << IPR14_SCANIP_POS)         /**< 0x04 */
#define IPR14_ACTIP (1u << IPR14_ACTIP_POS)           /**< 0x02 */
#define IPR14_NVMIP (1u << IPR14_NVMIP_POS)           /**< 0x01 */

/* ============================================================================
 *  IPR15 - Interrupt Priority Register 15
 * ============================================================================
 *  Address: 0x036F
 *
 *    Bit 7 - DMA8AIP   : DMA8 Abort priority
 *    Bit 6 - DMA8ORIP  : DMA8 Overrun priority
 *    Bit 5 - DMA8DCNTIP: DMA8 Destination Count priority
 *    Bit 4 - DMA8SCNTIP: DMA8 Source Count priority
 *    Bit 3:0 - Reserved
 * ========================================================================= */

#define IPR15_DMA8AIP_POS 7
#define IPR15_DMA8ORIP_POS 6
#define IPR15_DMA8DCNTIP_POS 5
#define IPR15_DMA8SCNTIP_POS 4

#define IPR15_DMA8AIP (1u << IPR15_DMA8AIP_POS)       /**< 0x80 */
#define IPR15_DMA8ORIP (1u << IPR15_DMA8ORIP_POS)     /**< 0x40 */
#define IPR15_DMA8DCNTIP (1u << IPR15_DMA8DCNTIP_POS) /**< 0x20 */
#define IPR15_DMA8SCNTIP (1u << IPR15_DMA8SCNTIP_POS) /**< 0x10 */

