Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_vic.h
/* ****************************************************************************
 *  Section 3 - Peripheral Interrupt Enable Registers (PIE0-PIE15)
 * ****************************************************************************
 *
 *  Addresses: 0x049E-0x04AD  (sixteen 8-bit registers)
 *
 *  Each bit enables the interrupt for one peripheral source:
 *    1 = Interrupt enabled for the corresponding source
 *    0 = Interrupt disabled
 *
 *  The bit positions in PIEx correspond directly to the same sources
 *  as PIRx and IPRx.  The suffix convention is "IE" (Interrupt Enable).
 * ***************************************************************************/

/* -- PIE Register Addresses ----------------------------------------------- */
#define PIE0_ADDR 0x049Eu
#define PIE1_ADDR 0x049Fu
#define PIE2_ADDR 0x04A0u
#define PIE3_ADDR 0x04A1u
#define PIE4_ADDR 0x04A2u
#define PIE5_ADDR 0x04A3u
#define PIE6_ADDR 0x04A4u
#define PIE7_ADDR 0x04A5u
#define PIE8_ADDR 0x04A6u
#define PIE9_ADDR 0x04A7u
#define PIE10_ADDR 0x04A8u
#define PIE11_ADDR 0x04A9u
#define PIE12_ADDR 0x04AAu
#define PIE13_ADDR 0x04ABu
#define PIE14_ADDR 0x04ACu
#define PIE15_ADDR 0x04ADu

/* -- PIE Register Access -------------------------------------------------- */
#define PIE0 SFR8(PIE0_ADDR)
#define PIE1 SFR8(PIE1_ADDR)
#define PIE2 SFR8(PIE2_ADDR)
#define PIE3 SFR8(PIE3_ADDR)
#define PIE4 SFR8(PIE4_ADDR)
#define PIE5 SFR8(PIE5_ADDR)
#define PIE6 SFR8(PIE6_ADDR)
#define PIE7 SFR8(PIE7_ADDR)
#define PIE8 SFR8(PIE8_ADDR)
#define PIE9 SFR8(PIE9_ADDR)
#define PIE10 SFR8(PIE10_ADDR)
#define PIE11 SFR8(PIE11_ADDR)
#define PIE12 SFR8(PIE12_ADDR)
#define PIE13 SFR8(PIE13_ADDR)
#define PIE14 SFR8(PIE14_ADDR)
#define PIE15 SFR8(PIE15_ADDR)

/* ============================================================================
 *  PIE0 / PIR0 Bit Definitions
 * ============================================================================
 *  The PIE and PIR registers share the same bit layout for each register
 *  index.  The suffix changes from "IE" (enable) to "IF" (flag).  Bit
 *  positions are identical for PIE0, PIR0, and IPR0.
 *
 *    Bit 7 - IOC   : Interrupt-on-Change
 *    Bit 6 - OSF   : Oscillator Fail (Fail-Safe Clock Monitor)
 *    Bit 5 - HLVD  : High/Low-Voltage Detect
 *    Bit 4 - SWINT : Software Interrupt
 *    Bit 3 - CAN   : CAN Module
 *    Bit 2 - AD    : ADC Conversion Complete
 *    Bit 1 - ZCD   : Zero-Cross Detection
 *    Bit 0 - INT0  : External Interrupt 0
 * ========================================================================= */

/* -- PIE0 bit masks (Interrupt Enable) ------------------------------------ */
#define PIE0_IOCIE_POS 7
#define PIE0_OSFIE_POS 6
#define PIE0_HLVDIE_POS 5
#define PIE0_SWINTIE_POS 4
#define PIE0_CANIE_POS 3
#define PIE0_ADIE_POS 2
#define PIE0_ZCDIE_POS 1
#define PIE0_INT0IE_POS 0

#define PIE0_IOCIE (1u << PIE0_IOCIE_POS)     /**< 0x80 */
#define PIE0_OSFIE (1u << PIE0_OSFIE_POS)     /**< 0x40 */
#define PIE0_HLVDIE (1u << PIE0_HLVDIE_POS)   /**< 0x20 */
#define PIE0_SWINTIE (1u << PIE0_SWINTIE_POS) /**< 0x10 */
#define PIE0_CANIE (1u << PIE0_CANIE_POS)     /**< 0x08 */
#define PIE0_ADIE (1u << PIE0_ADIE_POS)       /**< 0x04 */
#define PIE0_ZCDIE (1u << PIE0_ZCDIE_POS)     /**< 0x02 */
#define PIE0_INT0IE (1u << PIE0_INT0IE_POS)   /**< 0x01 */

/* ============================================================================
 *  PIE1 Bit Definitions (Interrupt Enable)
 * ========================================================================= */
#define PIE1_CLC1IE (1u << 7)   /**< CLC1 interrupt enable        */
#define PIE1_ADCH3IE (1u << 6)  /**< ADC Channel 3 Threshold IE   */
#define PIE1_ADCH2IE (1u << 5)  /**< ADC Channel 2 Threshold IE   */
#define PIE1_ADCH1IE (1u << 4)  /**< ADC Channel 1 Threshold IE   */
#define PIE1_TU16AIE (1u << 3)  /**< Universal Timer 16A IE       */
#define PIE1_SPI1IE (1u << 2)   /**< SPI1 General IE              */
#define PIE1_SPI1TXIE (1u << 1) /**< SPI1 Transmit IE             */
#define PIE1_SPI1RXIE (1u << 0) /**< SPI1 Receive IE              */

/* ============================================================================
 *  PIE2 Bit Definitions (Interrupt Enable)
 * ========================================================================= */
#define PIE2_CSWIIE (1u << 7)    /**< Clock Switch IE              */
#define PIE2_SMT1PWAIE (1u << 6) /**< SMT1 Period/Width Acq. IE    */
#define PIE2_SMT1PRAIE (1u << 5) /**< SMT1 Pulse/Running Acq. IE   */
#define PIE2_SMT1IE (1u << 4)    /**< SMT1 Match IE                */
#define PIE2_U1EIE (1u << 3)     /**< UART1 Error IE               */
#define PIE2_SPI2IE (1u << 2)    /**< SPI2 General IE              */
#define PIE2_SPI2TXIE (1u << 1)  /**< SPI2 Transmit IE             */
#define PIE2_SPI2RXIE (1u << 0)  /**< SPI2 Receive IE              */

/* ============================================================================
 *  PIE3 Bit Definitions (Interrupt Enable)
 * ========================================================================= */
#define PIE3_DMA1AIE (1u << 7)    /**< DMA1 Abort IE                */
#define PIE3_DMA1ORIE (1u << 6)   /**< DMA1 Overrun IE              */
#define PIE3_DMA1DCNTIE (1u << 5) /**< DMA1 Destination Count IE    */
#define PIE3_DMA1SCNTIE (1u << 4) /**< DMA1 Source Count IE         */
#define PIE3_ADCH4IE (1u << 3)    /**< ADC Channel 4 Threshold IE   */
#define PIE3_CM1IE (1u << 2)      /**< Comparator 1 IE              */
#define PIE3_CWG1IE (1u << 1)     /**< CWG1 IE                      */
#define PIE3_I2C1IE (1u << 0)     /**< I2C1 General IE              */

/* ============================================================================
 *  PIE4 Bit Definitions (Interrupt Enable)
 * ========================================================================= */
#define PIE4_TMR0IE (1u << 7)  /**< Timer0 IE                    */
#define PIE4_CCP1IE (1u << 6)  /**< CCP1 IE                      */
#define PIE4_TMR1GIE (1u << 5) /**< Timer1 Gate IE               */
#define PIE4_TMR1IE (1u << 4)  /**< Timer1 Overflow IE           */
#define PIE4_TMR2IE (1u << 3)  /**< Timer2 Match IE              */
#define PIE4_U1IE (1u << 2)    /**< UART1 General IE             */
#define PIE4_U1TXIE (1u << 1)  /**< UART1 Transmit IE            */
#define PIE4_U1RXIE (1u << 0)  /**< UART1 Receive IE             */

/* ============================================================================
 *  PIE5 Bit Definitions (Interrupt Enable)
 * ========================================================================= */
#define PIE5_PWM1IE (1u << 7)   /**< PWM1 Period Match IE         */
#define PIE5_PWM1PIE (1u << 6)  /**< PWM1 Parameter IE            */
#define PIE5_CANTIE (1u << 5)   /**< CAN Transmit IE              */
#define PIE5_CANRIE (1u << 4)   /**< CAN Receive IE               */
#define PIE5_I2C1EIE (1u << 3)  /**< I2C1 Error IE                */
#define PIE5_I2C1TXIE (1u << 2) /**< I2C1 Transmit IE             */
#define PIE5_I2C1RXIE (1u << 1) /**< I2C1 Receive IE              */
#define PIE5_INT1IE (1u << 0)   /**< External Interrupt 1 IE      */

/* ============================================================================
 *  PIE6 Bit Definitions (Interrupt Enable)
 * ========================================================================= */
#define PIE6_PWM2IE (1u << 7)  /**< PWM2 Period Match IE         */
#define PIE6_PWM2PIE (1u << 6) /**< PWM2 Parameter IE            */
#define PIE6_TMR3GIE (1u << 5) /**< Timer3 Gate IE               */
#define PIE6_TMR3IE (1u << 4)  /**< Timer3 Overflow IE           */
#define PIE6_TU16BIE (1u << 3) /**< Universal Timer 16B IE       */
#define PIE6_U2IE (1u << 2)    /**< UART2 General IE             */
#define PIE6_U2TXIE (1u << 1)  /**< UART2 Transmit IE            */
#define PIE6_U2RXIE (1u << 0)  /**< UART2 Receive IE             */

/* ============================================================================
 *  PIE7 Bit Definitions (Interrupt Enable)
 * ========================================================================= */
#define PIE7_DMA2AIE (1u << 7)    /**< DMA2 Abort IE                */
#define PIE7_DMA2ORIE (1u << 6)   /**< DMA2 Overrun IE              */
#define PIE7_DMA2DCNTIE (1u << 5) /**< DMA2 Destination Count IE    */
#define PIE7_DMA2SCNTIE (1u << 4) /**< DMA2 Source Count IE         */
#define PIE7_NCO1IE (1u << 3)     /**< NCO1 IE                      */
#define PIE7_U2EIE (1u << 2)      /**< UART2 Error IE               */
#define PIE7_CLC2IE (1u << 1)     /**< CLC2 IE                      */
#define PIE7_INT2IE (1u << 0)     /**< External Interrupt 2 IE      */

/* ============================================================================
 *  PIE8 Bit Definitions (Interrupt Enable)
 * ========================================================================= */
#define PIE8_CLC3IE (1u << 7)  /**< CLC3 IE                      */
#define PIE8_CCP2IE (1u << 6)  /**< CCP2 IE                      */
#define PIE8_TMR5GIE (1u << 5) /**< Timer5 Gate IE               */
#define PIE8_TMR5IE (1u << 4)  /**< Timer5 Overflow IE           */
#define PIE8_TMR4IE (1u << 3)  /**< Timer4 Match IE              */
#define PIE8_CWG2IE (1u << 2)  /**< CWG2 IE                      */
#define PIE8_CM2IE (1u << 1)   /**< Comparator 2 IE              */
#define PIE8_NCO2IE (1u << 0)  /**< NCO2 IE                      */

/* ============================================================================
 *  PIE9 Bit Definitions (Interrupt Enable)
 * ========================================================================= */
#define PIE9_DMA3AIE (1u << 7)    /**< DMA3 Abort IE                */
#define PIE9_DMA3ORIE (1u << 6)   /**< DMA3 Overrun IE              */
#define PIE9_DMA3DCNTIE (1u << 5) /**< DMA3 Destination Count IE    */
#define PIE9_DMA3SCNTIE (1u << 4) /**< DMA3 Source Count IE         */
#define PIE9_PWM3IE (1u << 3)     /**< PWM3 Period Match IE         */
#define PIE9_PWM3PIE (1u << 2)    /**< PWM3 Parameter IE            */
#define PIE9_CWG3IE (1u << 1)     /**< CWG3 IE                      */
#define PIE9_NCO3IE (1u << 0)     /**< NCO3 IE                      */

/* ============================================================================
 *  PIE10 Bit Definitions (Interrupt Enable)
 * ========================================================================= */
#define PIE10_CLC4IE (1u << 7) /**< CLC4 IE                      */
#define PIE10_CCP3IE (1u << 6) /**< CCP3 IE                      */
#define PIE10_U3EIE (1u << 5)  /**< UART3 Error IE               */
#define PIE10_U3IE (1u << 4)   /**< UART3 General IE             */
#define PIE10_U3TXIE (1u << 3) /**< UART3 Transmit IE            */
#define PIE10_U3RXIE (1u << 2) /**< UART3 Receive IE             */
#define PIE10_TMR6IE (1u << 1) /**< Timer6 Match IE              */
#define PIE10_DSMIE (1u << 0)  /**< DSM IE                       */

/* ============================================================================
 *  PIE11 Bit Definitions (Interrupt Enable)
 * ========================================================================= */
#define PIE11_DMA4AIE (1u << 7)    /**< DMA4 Abort IE                */
#define PIE11_DMA4ORIE (1u << 6)   /**< DMA4 Overrun IE              */
#define PIE11_DMA4DCNTIE (1u << 5) /**< DMA4 Destination Count IE    */
#define PIE11_DMA4SCNTIE (1u << 4) /**< DMA4 Source Count IE         */
#define PIE11_CLC5IE (1u << 3)     /**< CLC5 IE                      */
#define PIE11_CLC6IE (1u << 2)     /**< CLC6 IE                      */
#define PIE11_U4EIE (1u << 1)      /**< UART4 Error IE               */
#define PIE11_U4IE (1u << 0)       /**< UART4 General IE             */

/* ============================================================================
 *  PIE12 Bit Definitions (Interrupt Enable)
 * ========================================================================= */
#define PIE12_U4TXIE (1u << 7)     /**< UART4 Transmit IE            */
#define PIE12_U4RXIE (1u << 6)     /**< UART4 Receive IE             */
#define PIE12_DMA5AIE (1u << 5)    /**< DMA5 Abort IE                */
#define PIE12_DMA5ORIE (1u << 4)   /**< DMA5 Overrun IE              */
#define PIE12_DMA5DCNTIE (1u << 3) /**< DMA5 Destination Count IE    */
#define PIE12_DMA5SCNTIE (1u << 2) /**< DMA5 Source Count IE         */
#define PIE12_CLC7IE (1u << 1)     /**< CLC7 IE                      */
#define PIE12_CLC8IE (1u << 0)     /**< CLC8 IE                      */

/* ============================================================================
 *  PIE13 Bit Definitions (Interrupt Enable)
 * ========================================================================= */
#define PIE13_DMA6AIE (1u << 7)    /**< DMA6 Abort IE                */
#define PIE13_DMA6ORIE (1u << 6)   /**< DMA6 Overrun IE              */
#define PIE13_DMA6DCNTIE (1u << 5) /**< DMA6 Destination Count IE    */
#define PIE13_DMA6SCNTIE (1u << 4) /**< DMA6 Source Count IE         */
#define PIE13_U5EIE (1u << 3)      /**< UART5 Error IE               */
#define PIE13_U5IE (1u << 2)       /**< UART5 General IE             */
#define PIE13_U5TXIE (1u << 1)     /**< UART5 Transmit IE            */
#define PIE13_U5RXIE (1u << 0)     /**< UART5 Receive IE             */

/* ============================================================================
 *  PIE14 Bit Definitions (Interrupt Enable)
 * ========================================================================= */
#define PIE14_DMA7AIE (1u << 7)    /**< DMA7 Abort IE                */
#define PIE14_DMA7ORIE (1u << 6)   /**< DMA7 Overrun IE              */
#define PIE14_DMA7DCNTIE (1u << 5) /**< DMA7 Destination Count IE    */
#define PIE14_DMA7SCNTIE (1u << 4) /**< DMA7 Source Count IE         */
#define PIE14_CRCIE (1u << 3)      /**< CRC IE                       */
#define PIE14_SCANIE (1u << 2)     /**< NVM Scanner IE               */
#define PIE14_ACTIE (1u << 1)      /**< Active Clock Tuning IE       */
#define PIE14_NVMIE (1u << 0)      /**< NVM Write Complete IE        */

/* ============================================================================
 *  PIE15 Bit Definitions (Interrupt Enable)
 * ========================================================================= */
#define PIE15_DMA8AIE (1u << 7)    /**< DMA8 Abort IE                */
#define PIE15_DMA8ORIE (1u << 6)   /**< DMA8 Overrun IE              */
#define PIE15_DMA8DCNTIE (1u << 5) /**< DMA8 Destination Count IE    */
#define PIE15_DMA8SCNTIE (1u << 4) /**< DMA8 Source Count IE         */
/* Bits 3:0 reserved */

