Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_vic.h
/* ****************************************************************************
 *  Section 4 - Peripheral Interrupt Request (Flag) Registers (PIR0-PIR15)
 * ****************************************************************************
 *
 *  Addresses: 0x04AE-0x04BD  (sixteen 8-bit registers)
 *
 *  Each bit indicates a pending interrupt from one peripheral source:
 *    1 = Interrupt condition occurred (flag set by hardware)
 *    0 = No interrupt pending
 *
 *  Most flags must be cleared by software (write 0).  Some flags are
 *  read-only and are cleared automatically by the hardware when the
 *  triggering condition is resolved (e.g., reading a UART data register).
 *
 *  The bit positions in PIRx correspond directly to the same sources
 *  as PIEx and IPRx.  The suffix convention is "IF" (Interrupt Flag).
 * ***************************************************************************/

/* -- PIR Register Addresses ----------------------------------------------- */
#define PIR0_ADDR 0x04AEu
#define PIR1_ADDR 0x04AFu
#define PIR2_ADDR 0x04B0u
#define PIR3_ADDR 0x04B1u
#define PIR4_ADDR 0x04B2u
#define PIR5_ADDR 0x04B3u
#define PIR6_ADDR 0x04B4u
#define PIR7_ADDR 0x04B5u
#define PIR8_ADDR 0x04B6u
#define PIR9_ADDR 0x04B7u
#define PIR10_ADDR 0x04B8u
#define PIR11_ADDR 0x04B9u
#define PIR12_ADDR 0x04BAu
#define PIR13_ADDR 0x04BBu
#define PIR14_ADDR 0x04BCu
#define PIR15_ADDR 0x04BDu

/* -- PIR Register Access -------------------------------------------------- */
#define PIR0 SFR8(PIR0_ADDR)
#define PIR1 SFR8(PIR1_ADDR)
#define PIR2 SFR8(PIR2_ADDR)
#define PIR3 SFR8(PIR3_ADDR)
#define PIR4 SFR8(PIR4_ADDR)
#define PIR5 SFR8(PIR5_ADDR)
#define PIR6 SFR8(PIR6_ADDR)
#define PIR7 SFR8(PIR7_ADDR)
#define PIR8 SFR8(PIR8_ADDR)
#define PIR9 SFR8(PIR9_ADDR)
#define PIR10 SFR8(PIR10_ADDR)
#define PIR11 SFR8(PIR11_ADDR)
#define PIR12 SFR8(PIR12_ADDR)
#define PIR13 SFR8(PIR13_ADDR)
#define PIR14 SFR8(PIR14_ADDR)
#define PIR15 SFR8(PIR15_ADDR)

/* ============================================================================
 *  PIR0 Bit Definitions (Interrupt Flags)
 * ============================================================================
 *  Bit positions are identical to PIE0 / IPR0.
 * ========================================================================= */

#define PIR0_IOCIF_POS 7
#define PIR0_OSFIF_POS 6
#define PIR0_HLVDIF_POS 5
#define PIR0_SWINTIF_POS 4
#define PIR0_CANIF_POS 3
#define PIR0_ADIF_POS 2
#define PIR0_ZCDIF_POS 1
#define PIR0_INT0IF_POS 0

#define PIR0_IOCIF (1u << PIR0_IOCIF_POS)     /**< 0x80 - IOC flag (read-only, cleared by IOC regs)  */
#define PIR0_OSFIF (1u << PIR0_OSFIF_POS)     /**< 0x40 - Oscillator Fail flag                      */
#define PIR0_HLVDIF (1u << PIR0_HLVDIF_POS)   /**< 0x20 - HLVD trip flag                            */
#define PIR0_SWINTIF (1u << PIR0_SWINTIF_POS) /**< 0x10 - Software Interrupt flag                   */
#define PIR0_CANIF (1u << PIR0_CANIF_POS)     /**< 0x08 - CAN module flag                           */
#define PIR0_ADIF (1u << PIR0_ADIF_POS)       /**< 0x04 - ADC Conversion Complete flag              */
#define PIR0_ZCDIF (1u << PIR0_ZCDIF_POS)     /**< 0x02 - Zero-Cross Detection flag                 */
#define PIR0_INT0IF (1u << PIR0_INT0IF_POS)   /**< 0x01 - External Interrupt 0 flag                 */

/* ============================================================================
 *  PIR1 Bit Definitions (Interrupt Flags)
 * ========================================================================= */
#define PIR1_CLC1IF (1u << 7)   /**< CLC1 interrupt flag          */
#define PIR1_ADCH3IF (1u << 6)  /**< ADC Channel 3 Threshold IF   */
#define PIR1_ADCH2IF (1u << 5)  /**< ADC Channel 2 Threshold IF   */
#define PIR1_ADCH1IF (1u << 4)  /**< ADC Channel 1 Threshold IF   */
#define PIR1_TU16AIF (1u << 3)  /**< Universal Timer 16A IF       */
#define PIR1_SPI1IF (1u << 2)   /**< SPI1 General IF              */
#define PIR1_SPI1TXIF (1u << 1) /**< SPI1 Transmit IF             */
#define PIR1_SPI1RXIF (1u << 0) /**< SPI1 Receive IF              */

/* ============================================================================
 *  PIR2 Bit Definitions (Interrupt Flags)
 * ========================================================================= */
#define PIR2_CSWIIF (1u << 7)    /**< Clock Switch IF              */
#define PIR2_SMT1PWAIF (1u << 6) /**< SMT1 Period/Width Acq. IF    */
#define PIR2_SMT1PRAIF (1u << 5) /**< SMT1 Pulse/Running Acq. IF   */
#define PIR2_SMT1IF (1u << 4)    /**< SMT1 Match IF                */
#define PIR2_U1EIF (1u << 3)     /**< UART1 Error IF               */
#define PIR2_SPI2IF (1u << 2)    /**< SPI2 General IF              */
#define PIR2_SPI2TXIF (1u << 1)  /**< SPI2 Transmit IF             */
#define PIR2_SPI2RXIF (1u << 0)  /**< SPI2 Receive IF              */

/* ============================================================================
 *  PIR3 Bit Definitions (Interrupt Flags)
 * ========================================================================= */
#define PIR3_DMA1AIF (1u << 7)    /**< DMA1 Abort IF                */
#define PIR3_DMA1ORIF (1u << 6)   /**< DMA1 Overrun IF              */
#define PIR3_DMA1DCNTIF (1u << 5) /**< DMA1 Destination Count IF    */
#define PIR3_DMA1SCNTIF (1u << 4) /**< DMA1 Source Count IF         */
#define PIR3_ADCH4IF (1u << 3)    /**< ADC Channel 4 Threshold IF   */
#define PIR3_CM1IF (1u << 2)      /**< Comparator 1 IF              */
#define PIR3_CWG1IF (1u << 1)     /**< CWG1 IF                      */
#define PIR3_I2C1IF (1u << 0)     /**< I2C1 General IF              */

/* ============================================================================
 *  PIR4 Bit Definitions (Interrupt Flags)
 * ========================================================================= */
#define PIR4_TMR0IF (1u << 7)  /**< Timer0 IF                    */
#define PIR4_CCP1IF (1u << 6)  /**< CCP1 IF                      */
#define PIR4_TMR1GIF (1u << 5) /**< Timer1 Gate IF               */
#define PIR4_TMR1IF (1u << 4)  /**< Timer1 Overflow IF           */
#define PIR4_TMR2IF (1u << 3)  /**< Timer2 Match IF              */
#define PIR4_U1IF (1u << 2)    /**< UART1 General IF             */
#define PIR4_U1TXIF (1u << 1)  /**< UART1 Transmit IF            */
#define PIR4_U1RXIF (1u << 0)  /**< UART1 Receive IF             */

/* ============================================================================
 *  PIR5 Bit Definitions (Interrupt Flags)
 * ========================================================================= */
#define PIR5_PWM1IF (1u << 7)   /**< PWM1 Period Match IF         */
#define PIR5_PWM1PIF (1u << 6)  /**< PWM1 Parameter IF            */
#define PIR5_CANTIF (1u << 5)   /**< CAN Transmit IF              */
#define PIR5_CANRIF (1u << 4)   /**< CAN Receive IF               */
#define PIR5_I2C1EIF (1u << 3)  /**< I2C1 Error IF                */
#define PIR5_I2C1TXIF (1u << 2) /**< I2C1 Transmit IF             */
#define PIR5_I2C1RXIF (1u << 1) /**< I2C1 Receive IF              */
#define PIR5_INT1IF (1u << 0)   /**< External Interrupt 1 IF      */

/* ============================================================================
 *  PIR6 Bit Definitions (Interrupt Flags)
 * ========================================================================= */
#define PIR6_PWM2IF (1u << 7)  /**< PWM2 Period Match IF         */
#define PIR6_PWM2PIF (1u << 6) /**< PWM2 Parameter IF            */
#define PIR6_TMR3GIF (1u << 5) /**< Timer3 Gate IF               */
#define PIR6_TMR3IF (1u << 4)  /**< Timer3 Overflow IF           */
#define PIR6_TU16BIF (1u << 3) /**< Universal Timer 16B IF       */
#define PIR6_U2IF (1u << 2)    /**< UART2 General IF             */
#define PIR6_U2TXIF (1u << 1)  /**< UART2 Transmit IF            */
#define PIR6_U2RXIF (1u << 0)  /**< UART2 Receive IF             */

/* ============================================================================
 *  PIR7 Bit Definitions (Interrupt Flags)
 * ========================================================================= */
#define PIR7_DMA2AIF (1u << 7)    /**< DMA2 Abort IF                */
#define PIR7_DMA2ORIF (1u << 6)   /**< DMA2 Overrun IF              */
#define PIR7_DMA2DCNTIF (1u << 5) /**< DMA2 Destination Count IF    */
#define PIR7_DMA2SCNTIF (1u << 4) /**< DMA2 Source Count IF         */
#define PIR7_NCO1IF (1u << 3)     /**< NCO1 IF                      */
#define PIR7_U2EIF (1u << 2)      /**< UART2 Error IF               */
#define PIR7_CLC2IF (1u << 1)     /**< CLC2 IF                      */
#define PIR7_INT2IF (1u << 0)     /**< External Interrupt 2 IF      */

/* ============================================================================
 *  PIR8 Bit Definitions (Interrupt Flags)
 * ========================================================================= */
#define PIR8_CLC3IF (1u << 7)  /**< CLC3 IF                      */
#define PIR8_CCP2IF (1u << 6)  /**< CCP2 IF                      */
#define PIR8_TMR5GIF (1u << 5) /**< Timer5 Gate IF               */
#define PIR8_TMR5IF (1u << 4)  /**< Timer5 Overflow IF           */
#define PIR8_TMR4IF (1u << 3)  /**< Timer4 Match IF              */
#define PIR8_CWG2IF (1u << 2)  /**< CWG2 IF                      */
#define PIR8_CM2IF (1u << 1)   /**< Comparator 2 IF              */
#define PIR8_NCO2IF (1u << 0)  /**< NCO2 IF                      */

/* ============================================================================
 *  PIR9 Bit Definitions (Interrupt Flags)
 * ========================================================================= */
#define PIR9_DMA3AIF (1u << 7)    /**< DMA3 Abort IF                */
#define PIR9_DMA3ORIF (1u << 6)   /**< DMA3 Overrun IF              */
#define PIR9_DMA3DCNTIF (1u << 5) /**< DMA3 Destination Count IF    */
#define PIR9_DMA3SCNTIF (1u << 4) /**< DMA3 Source Count IF         */
#define PIR9_PWM3IF (1u << 3)     /**< PWM3 Period Match IF         */
#define PIR9_PWM3PIF (1u << 2)    /**< PWM3 Parameter IF            */
#define PIR9_CWG3IF (1u << 1)     /**< CWG3 IF                      */
#define PIR9_NCO3IF (1u << 0)     /**< NCO3 IF                      */

/* ============================================================================
 *  PIR10 Bit Definitions (Interrupt Flags)
 * ========================================================================= */
#define PIR10_CLC4IF (1u << 7) /**< CLC4 IF                      */
#define PIR10_CCP3IF (1u << 6) /**< CCP3 IF                      */
#define PIR10_U3EIF (1u << 5)  /**< UART3 Error IF               */
#define PIR10_U3IF (1u << 4)   /**< UART3 General IF             */
#define PIR10_U3TXIF (1u << 3) /**< UART3 Transmit IF            */
#define PIR10_U3RXIF (1u << 2) /**< UART3 Receive IF             */
#define PIR10_TMR6IF (1u << 1) /**< Timer6 Match IF              */
#define PIR10_DSMIF (1u << 0)  /**< DSM IF                       */

/* ============================================================================
 *  PIR11 Bit Definitions (Interrupt Flags)
 * ========================================================================= */
#define PIR11_DMA4AIF (1u << 7)    /**< DMA4 Abort IF                */
#define PIR11_DMA4ORIF (1u << 6)   /**< DMA4 Overrun IF              */
#define PIR11_DMA4DCNTIF (1u << 5) /**< DMA4 Destination Count IF    */
#define PIR11_DMA4SCNTIF (1u << 4) /**< DMA4 Source Count IF         */
#define PIR11_CLC5IF (1u << 3)     /**< CLC5 IF                      */
#define PIR11_CLC6IF (1u << 2)     /**< CLC6 IF                      */
#define PIR11_U4EIF (1u << 1)      /**< UART4 Error IF               */
#define PIR11_U4IF (1u << 0)       /**< UART4 General IF             */

/* ============================================================================
 *  PIR12 Bit Definitions (Interrupt Flags)
 * ========================================================================= */
#define PIR12_U4TXIF (1u << 7)     /**< UART4 Transmit IF            */
#define PIR12_U4RXIF (1u << 6)     /**< UART4 Receive IF             */
#define PIR12_DMA5AIF (1u << 5)    /**< DMA5 Abort IF                */
#define PIR12_DMA5ORIF (1u << 4)   /**< DMA5 Overrun IF              */
#define PIR12_DMA5DCNTIF (1u << 3) /**< DMA5 Destination Count IF    */
#define PIR12_DMA5SCNTIF (1u << 2) /**< DMA5 Source Count IF         */
#define PIR12_CLC7IF (1u << 1)     /**< CLC7 IF                      */
#define PIR12_CLC8IF (1u << 0)     /**< CLC8 IF                      */

/* ============================================================================
 *  PIR13 Bit Definitions (Interrupt Flags)
 * ========================================================================= */
#define PIR13_DMA6AIF (1u << 7)    /**< DMA6 Abort IF                */
#define PIR13_DMA6ORIF (1u << 6)   /**< DMA6 Overrun IF              */
#define PIR13_DMA6DCNTIF (1u << 5) /**< DMA6 Destination Count IF    */
#define PIR13_DMA6SCNTIF (1u << 4) /**< DMA6 Source Count IF         */
#define PIR13_U5EIF (1u << 3)      /**< UART5 Error IF               */
#define PIR13_U5IF (1u << 2)       /**< UART5 General IF             */
#define PIR13_U5TXIF (1u << 1)     /**< UART5 Transmit IF            */
#define PIR13_U5RXIF (1u << 0)     /**< UART5 Receive IF             */

/* ============================================================================
 *  PIR14 Bit Definitions (Interrupt Flags)
 * ========================================================================= */
#define PIR14_DMA7AIF (1u << 7)    /**< DMA7 Abort IF                */
#define PIR14_DMA7ORIF (1u << 6)   /**< DMA7 Overrun IF              */
#define PIR14_DMA7DCNTIF (1u << 5) /**< DMA7 Destination Count IF    */
#define PIR14_DMA7SCNTIF (1u << 4) /**< DMA7 Source Count IF         */
#define PIR14_CRCIF (1u << 3)      /**< CRC IF                       */
#define PIR14_SCANF (1u << 2)      /**< NVM Scanner IF               */
#define PIR14_ACTIF (1u << 1)      /**< Active Clock Tuning IF       */
#define PIR14_NVMIF (1u << 0)      /**< NVM Write Complete IF        */

/* ============================================================================
 *  PIR15 Bit Definitions (Interrupt Flags)
 * ========================================================================= */
#define PIR15_DMA8AIF (1u << 7)    /**< DMA8 Abort IF                */
#define PIR15_DMA8ORIF (1u << 6)   /**< DMA8 Overrun IF              */
#define PIR15_DMA8DCNTIF (1u << 5) /**< DMA8 Destination Count IF    */
#define PIR15_DMA8SCNTIF (1u << 4) /**< DMA8 Source Count IF         */
/* Bits 3:0 reserved */

/* ****************************************************************************
 *  Section 5 - Software Interrupt
 * ****************************************************************************
 *
 *  The PIC18F-Q84 provides a single software-triggered interrupt via
 *  PIR0.SWINTIF.  Writing 1 to SWINTIF sets the software interrupt flag,
 *  which (if PIE0.SWINTIE is enabled) triggers an interrupt through the
 *  normal VIC path.  The flag must be cleared by software.
 *
 *  No dedicated register is needed; simply write to PIR0:
 *
 *      PIR0 |= PIR0_SWINTIF;   // trigger software interrupt
 *      PIR0 &= ~PIR0_SWINTIF;  // clear software interrupt
 *
 * ***************************************************************************/

#endif /* PIC18F_Q84_VIC_H */
